import './assets/main.css'

import {createApp} from 'vue'
import {createPinia} from 'pinia'

// імпортуємо кореневий компонент програми з одно-файлового компонента.
import App from './App.vue'
import router from './router'

/*
Кожен додаток Vue починається зі створення нового екземпляру додатку
функцією createApp({параметри кореневого компонента }):

App - обʼєкт, який ми передаємо в createApp є, по суті, компонентом.
Кожен додаток вимагає "кореневого компонента", який може містити інші дочірні компоненти.
 */
const app = createApp(App)

/*
Реєстрація додаткових ресурсів
 */
app.use(createPinia())
app.use(router)

/*
Екземпляр додатка не буде нічого рендерити, допоки метод .mount() не буде викликаний.
Він очікує аргумент-контейнер, який може бути актуальним
DOM елементом або рядком-селектором: <div id="app"></div>

Вміст кореневого компонента буде рендеритись всередині контейнера.
Сам елемент-контейнер не вважається частиною додатка.

Метод .mount() завжди має викликатись після усіх налаштувань додатку, та після реєстрацій додаткових ресурсів.
Варто зазначити, що він, на відміну від методів реєстрації додаткових ресурсів,
повертає екземпляр кореневого компонента замість екземпляра додатка.
 */
app.mount('#app')
